document.write(`<p>1. Составьте программу, которая принимает с клавиатуры два числа: первое – количество учеников в классе, второе – количество стульев в кабинете.  Программа проверит соответствие между этими двумя значениями и выведет на экран соответствующую информацию.    ввод: 24, 28 ⇒ вывод: стульев хватает; ввод: 24, 22 ⇒ вывод: стульев не хватает.</p>`)

document.write(`<p>2. Составьте программу, которая выводит в консоль все однозначные положительные числа в возрастающем порядке.</p>`) 

document.write(`<p>3. Написать цикл, который выводит те числа из массива, которые больше или равны 20.</p>`)

document.write(`<p>4. Написать цикл, который выводит только нечетные числа массива.</p>`)

document.write(`<p>5. Составьте программу, которая выводит в консоль все двузначные положительные числа, делящиеся без остатка на 5 (начиная с наименьшего).</p>`)

document.write(`<p>6. Составьте программу, которая выводит в консоль все трехзначные положительные числа, делящиеся без остатка и на 3 и на 5 (начиная с наименьшего).</p>`)

document.write(`<p>7. Найти сумму четных и нечетных чисел из массива и вывести разницу между ними. Вычесть из большего меньшее.</p>`)


document.write(`<p>8. Дан массив numbers. Вывести в консоль все числа из массива.</p>`)

document.write(`<p>9. Сформировать новый массив numbers_squared и передать в него все элементы из массива numbers, возведенные в квадрат</p>`)

document.write(`<p>10. Напишите код, выполнив задание из каждого пункта отдельной строкой:</p>
    <p>Создайте пустой объект user.</p>
    <p>Добавьте свойство name со значением John.</p>
    <p>Добавьте свойство surname со значением Smith.</p>
    <p>Измените значение свойства name на Pete.</p>
    <p>Удалите свойство name из объекта.</p>`)

document.write(`<p>11. У нас есть следующий объект:

    <p>let user = {</p>
        <p>name: "John",</p>
        <p>age: 30</p>
    <p>};</p>

<p>Проверьте, что в объекте есть ключ age.</p>`)

document.write(`<p>12. Написать код, выполнив задание: если значение объекта является числом (number), то его значение надо увеличить вдвое.</p>`)

document.write(`<p>13. Пример объекта:

    <p>let menu = {</p>
        <p>width: 200,</p> 
        <p>height: 300,</p>
        <p>title: "my menu"</p>
    <p>};

<p>Результат:</p>

    <p>let menu = {</p>
        <p>width: 400,</p> 
        <p>height: 600,</p>
        <p>title: "my menu"</p>
    <p>};</p>`)



document.write(`<p>14. В следующих задачах будет использоваться массив из объектов, каждый из которых описывает определенный товар. </p>`)
/*Пример массива

let arr = [
            {
            id: 1,
            title: "bicycle",
            price: 45000,
            discount: 10
            },
            {
            id: 2,
            title: "roller-skates",
            price: 15000,
            discount: 5
            },
            {
            id: 3,
            title: "Kick scooter",
            price: 10000,
            discount: 30
            },
            {
            id: 4,
            title: "skis",
            price: 25000,
            discount: 20
            },
            {
            id: 5,
            title: "skate",
            price: 10000,
            discount: 0
        }
    ];)*/

document.write(`<p>14. 1.Написать цикл, который выводит только названия товаров.</p>`)
document.write(`<p>14. 2.Написать цикл, который выводит для каждого товара строку по маске “<название> (<цена>)”</p>`)
document.write(`<p>14. 3.Написать цикл, который выводит для каждого товара строку по маске “<название> (<цена со скидкой>)”</p>`)
 